newbie-jiang/STM32H750XB/cubemx_pro/STM32H750XB/BSP/LCD/lcd.c
	HAL_MPU_Disable();							//配置MPU之前先关闭MPU,配置完成以后在使能MPU	
	//外部SRAM为region0，大小为2MB，此区域可读写
	MPU_Initure.Enable=MPU_REGION_ENABLE;	    //使能region
	MPU_Initure.Number=LCD_REGION_NUMBER;		//设置region，外部SRAM使用的region0
	MPU_Initure.BaseAddress=LCD_ADDRESS_START;	//region基地址
	MPU_Initure.Size=LCD_REGION_SIZE;			//region大小
	MPU_Initure.SubRegionDisable=0X00;
	MPU_Initure.TypeExtField=MPU_TEX_LEVEL0;
	MPU_Initure.AccessPermission=MPU_REGION_FULL_ACCESS;	//此region可读写
	MPU_Initure.DisableExec=MPU_INSTRUCTION_ACCESS_ENABLE;	//允许读取此区域中的指令
	MPU_Initure.IsShareable=MPU_ACCESS_NOT_SHAREABLE;
	MPU_Initure.IsCacheable=MPU_ACCESS_NOT_CACHEABLE;
	MPU_Initure.IsBufferable=MPU_ACCESS_BUFFERABLE;
	HAL_MPU_ConfigRegion(&MPU_Initure);
	HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);     //开启MPU
}
//SRAM底层驱动，时钟使能，引脚分配
//此函数会被HAL_SRAM_Init()调用
//hsram:SRAM句柄
void HAL_SRAM_MspInit(SDRAM_HandleTypeDef *hsram)
{
    GPIO_InitTypeDef GPIO_Initure;
	
	__HAL_RCC_FMC_CLK_ENABLE();				//使能FMC时钟
	__HAL_RCC_GPIOD_CLK_ENABLE();			//使能GPIOD时钟
	__HAL_RCC_GPIOE_CLK_ENABLE();			//使能GPIOE时钟
	
	//初始化PD0,1,4,5,7,8,9,10,13,14,15
	GPIO_Initure.Pin=GPIO_PIN_0|GPIO_PIN_1|GPIO_PIN_4|GPIO_PIN_5|GPIO_PIN_7|GPIO_PIN_8|\
                     GPIO_PIN_9|GPIO_PIN_10|GPIO_PIN_13|GPIO_PIN_14|GPIO_PIN_15;
	GPIO_Initure.Mode=GPIO_MODE_AF_PP; 		//复用
	GPIO_Initure.Pull=GPIO_PULLUP;			//上拉
	GPIO_Initure.Speed=GPIO_SPEED_FREQ_VERY_HIGH;	//高速
	GPIO_Initure.Alternate=GPIO_AF12_FMC;	//复用为FMC
	HAL_GPIO_Init(GPIOD,&GPIO_Initure);
	
	//初始化PE7,8,9,10,11,12,13,14,15
	GPIO_Initure.Pin=GPIO_PIN_7|GPIO_PIN_8|GPIO_PIN_9|GPIO_PIN_10|GPIO_PIN_11|\
                     GPIO_PIN_12|GPIO_PIN_13|GPIO_PIN_14|GPIO_PIN_15;
	HAL_GPIO_Init(GPIOE,&GPIO_Initure);
}
        
//初始化lcd
//该初始化函数可以初始化各种型号的LCD(详见本.c文件最前面的描述)
void LCD_Init(void)
{ 	  
    GPIO_InitTypeDef GPIO_Initure;
	  FMC_NORSRAM_TimingTypeDef FSMC_ReadWriteTim;
    FMC_NORSRAM_TimingTypeDef FSMC_WriteTim;
    
    lcddev.id=LTDC_PanelID_Read();	//检查是否有RGB屏接入
	if(lcddev.id!=0)
	{
		LTDC_Init();			    //ID非零,说明有RGB屏接入.
	}
    else
    {    
//        __HAL_RCC_GPIOB_CLK_ENABLE();			//开启GPIOB时钟
//        GPIO_Initure.Pin=GPIO_PIN_5;           //PB5,背光控制
//        GPIO_Initure.Mode=GPIO_MODE_OUTPUT_PP;  //推挽输出
//        GPIO_Initure.Pull=GPIO_PULLUP;          //上拉
//        GPIO_Initure.Speed=GPIO_SPEED_FREQ_VERY_HIGH;    //高速
//        HAL_GPIO_Init(GPIOB,&GPIO_Initure); 
			 __HAL_RCC_GPIOD_CLK_ENABLE();			//开启GPIOB时钟
        GPIO_Initure.Pin=GPIO_PIN_4;           //PB5,背光控制
        GPIO_Initure.Mode=GPIO_MODE_OUTPUT_PP;  //推挽输出
        GPIO_Initure.Pull=GPIO_PULLUP;          //上拉
        GPIO_Initure.Speed=GPIO_SPEED_FREQ_VERY_HIGH;    //高速
        HAL_GPIO_Init(GPIOD,&GPIO_Initure); 
        
        LCD_MPU_Config();                       //使能MPU保护LCD区域
//        hsdram1.Instance=FMC_NORSRAM_DEVICE; //BANK1
//        hsdram1.Extended=FMC_NORSRAM_EXTENDED_DEVICE;       
//        
//        hsdram1.Init.SDBank=FMC_NORSRAM_BANK1;     //使用NE1
//        hsdram1.Init.DataAddressMux=FMC_DATA_ADDRESS_MUX_DISABLE;  //不复用数据线
//        hsdram1.Init.MemoryType=FMC_MEMORY_TYPE_SRAM;              //SRAM
//        hsdram1.Init.MemoryDataWidth=FMC_NORSRAM_MEM_BUS_WIDTH_16; //16位数据宽度
//        hsdram1.Init.BurstAccessMode=FMC_BURST_ACCESS_MODE_DISABLE; //是否使能突发访问,仅对同步突发存储器有效,此处未用到
//        hsdram1.Init.WaitSignalPolarity=FMC_WAIT_SIGNAL_POLARITY_LOW;//等待信号的极性,仅在突发模式访问下有用
//        hsdram1.Init.WaitSignalActive=FMC_WAIT_TIMING_BEFORE_WS;   //存储器是在等待周期之前的一个时钟周期还是等待周期期间使能NWAIT
//        hsdram1.Init.WriteOperation=FMC_WRITE_OPERATION_ENABLE;    //存储器写使能
//        hsdram1.Init.WaitSignal=FMC_WAIT_SIGNAL_DISABLE;           //等待使能位,此处未用到
//        hsdram1.Init.ExtendedMode=FMC_EXTENDED_MODE_ENABLE;        //读写使用不同的时序
//        hsdram1.Init.AsynchronousWait=FMC_ASYNCHRONOUS_WAIT_DISABLE;//是否使能同步传输模式下的等待信号,此处未用到
//        hsdram1.Init.WriteBurst=FMC_WRITE_BURST_DISABLE;           //禁止突发写
//        hsdram1.Init.ContinuousClock=FMC_CONTINUOUS_CLOCK_SYNC_ASYNC;
        
        //FSMC读时序控制寄存器
//        FSMC_ReadWriteTim.AddressSetupTime=0x11;    //地址建立时间(ADDSET)为17个HCLK 1/216M=4.6ns*17=78ns
//        FSMC_ReadWriteTim.AddressHoldTime=0x00;
//        FSMC_ReadWriteTim.DataSetupTime=0x55;       //数据保存时间(DATAST)为85个HCLK	=4.6*85=391ns
//        FSMC_ReadWriteTim.AccessMode=FMC_ACCESS_MODE_A; //模式A
//        //FSMC写时序控制寄存器
//        FSMC_WriteTim.AddressSetupTime=0x15;        //地址建立时间(ADDSET)为21个HCLK=96ns
//        FSMC_WriteTim.AddressHoldTime=0x00;
//        FSMC_WriteTim.DataSetupTime=0x15;           //数据保存时间(DATAST)为4.6ns*21个HCLK=96ns
//        FSMC_WriteTim.AccessMode=FMC_ACCESS_MODE_A;     //模式A
//		
//        HAL_SRAM_Init(&SRAM_Handler,&FSMC_ReadWriteTim,&FSMC_WriteTim);		
//        HAL_Delay(50); // delay 50 ms 
        
        //尝试9341 ID的读取		
        LCD_WR_REG(0XD3);				   
        lcddev.id=LCD_RD_DATA();	//dummy read 	
        lcddev.id=LCD_RD_DATA();	//读到0X00
        lcddev.id=LCD_RD_DATA();   	//读取93								   
        lcddev.id<<=8;
        lcddev.id|=LCD_RD_DATA();  	//读取41 	   			   
        if(lcddev.id!=0X9341)		//非9341,尝试看看是不是NT35310
        {
            LCD_WR_REG(0X04);
            lcddev.id = LCD_RD_DATA();      //dummy read
            lcddev.id = LCD_RD_DATA();      //读到0X85
            lcddev.id = LCD_RD_DATA();      //读取0X85
            lcddev.id <<= 8;
            lcddev.id |= LCD_RD_DATA();     //读取0X52

            if (lcddev.id == 0X8552)        //将8552的ID转换成7789
            {
                lcddev.id = 0x7789;
            }

            if (lcddev.id != 0x7789)        //也不是ST7789, 尝试是不是 NT35310
            {
                LCD_WR_REG(0XD4);				   
                lcddev.id=LCD_RD_DATA();//dummy read  
                lcddev.id=LCD_RD_DATA();//读回0X01	 
                lcddev.id=LCD_RD_DATA();//读回0X53	
                lcddev.id<<=8;	 
                lcddev.id|=LCD_RD_DATA();	//这里读回0X10	 
                if(lcddev.id!=0X5310)		//也不是NT35310,尝试看看是不是NT35510
                {
                    //发送秘钥（厂家提供,照搬即可）
                    LCD_WriteReg(0xF000, 0x0055);
                    LCD_WriteReg(0xF001, 0x00AA);
                    LCD_WriteReg(0xF002, 0x0052);
                    LCD_WriteReg(0xF003, 0x0008);
                    LCD_WriteReg(0xF004, 0x0001);

                    LCD_WR_REG(0xC500);             //读取ID高8位
                    lcddev.id = LCD_RD_DATA();      //读回0X55
                    lcddev.id <<= 8;

