newbie-jiang/STM32H750XB/cubemx_pro/STM32H750XB/BSP/LCD/lcd.c
            LCD_WR_REG(0xB3);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);

            LCD_WR_REG(0xB4);
            LCD_WR_DATA(0x8B);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x96);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0xA1);
            LCD_WR_DATA(0x00);

            LCD_WR_REG(0xB5);
            LCD_WR_DATA(0x02);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x03);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x04);
            LCD_WR_DATA(0x00);

            LCD_WR_REG(0xB6);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);

            LCD_WR_REG(0xB7);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x3F);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x5E);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x64);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x8C);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0xAC);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0xDC);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x70);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x90);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0xEB);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0xDC);
            LCD_WR_DATA(0x00);

            LCD_WR_REG(0xB8);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);

            LCD_WR_REG(0xBA);
            LCD_WR_DATA(0x24);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);

            LCD_WR_REG(0xC1);
            LCD_WR_DATA(0x20);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x54);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0xFF);
            LCD_WR_DATA(0x00);

            LCD_WR_REG(0xC2);
            LCD_WR_DATA(0x0A);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x04);
            LCD_WR_DATA(0x00);

            LCD_WR_REG(0xC3);
            LCD_WR_DATA(0x3C);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x3A);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x39);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x37);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x3C);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x36);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x32);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x2F);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x2C);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x29);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x26);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x24);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x24);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x23);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x3C);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x36);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x32);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x2F);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x2C);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x29);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x26);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x24);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x24);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x23);
            LCD_WR_DATA(0x00);

            LCD_WR_REG(0xC4);
            LCD_WR_DATA(0x62);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x05);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x84);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0xF0);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x18);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0xA4);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x18);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x50);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x0C);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x17);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x95);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0xF3);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0xE6);
            LCD_WR_DATA(0x00);

            LCD_WR_REG(0xC5);
            LCD_WR_DATA(0x32);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x44);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x65);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x76);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x88);
            LCD_WR_DATA(0x00);

            LCD_WR_REG(0xC6);
            LCD_WR_DATA(0x20);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x17);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x01);
            LCD_WR_DATA(0x00);

            LCD_WR_REG(0xC7);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);

            LCD_WR_REG(0xC8);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);

            LCD_WR_REG(0xC9);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);

